transformation-library/src/test/resources/patientprofile/dsq.response/patient_not_found.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">de55d649-51e8-4936-8202-34763371fb9b</cais:TrackingId>
        <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">a95dfedb-27d0-4b62-8a2d-a887a9c406c8
        </cais:TransactionId>
        <cais:SessionID xmlns:cais="http://cais-icp.org/v1">211ffcb750864bd0b3f727f397ffe</cais:SessionID>
    </s:Header>
    <s:Body>
        <PRPA_IN101104CA ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3"
                         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <id root="c14d9873-588e-44bc-a37e-aab8f762d048"/>
            <creationTime value="20210909160727"/>
            <responseModeCode code="I"/>
            <versionCode code="NE2006"/>
            <interactionId root="2.16.124.10.101.1.60.5.2.111" extension="PRPA_IN101104CA" displayable="true"/>
            <processingCode code="D"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.40.5.2" extension="TMPT-RI" use="BUS"/>
                    <agent xsi:nil="true"/>
                </device>
            </receiver>
            <respondTo xsi:nil="true"/>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                    <name>Registre des usagers</name>
                    <agent xsi:nil="true"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                    <id root="2.16.840.1.113883.3.40.1.5"/>
                </targetMessage>
            </acknowledgement>
            <controlActEvent moodCode="EVN">
                <id root="2.16.840.1.113883.3.40.4.1" extension="564654" use="BUS"/>
                <code code="PRPA_TE101104CA" codeSystem="2.16.840.1.113883.11.19427"/>
                <statusCode code="completed"/>
                <subjectOf typeCode="SUBJ" contextControlCode="AP">
                    <detectedIssueEvent classCode="ALRT" moodCode="EVN">
                        <code code="VALIDAT"/>
                        <text>La date de naissance doit être antérieure ou égale à la date du jour.</text>
                        <statusCode code="completed"/>
                        <priorityCode code="E"/>
                        <triggerFor xsi:nil="true"/>
                    </detectedIssueEvent>
                </subjectOf>
                <queryAck>
                    <queryId root="2.16.840.1.113883.3.40.1.5"/>
                    <queryResponseCode code="NF"/>
                    <resultTotalQuantity value="0"/>
                    <resultCurrentQuantity value="0"/>
                    <resultRemainingQuantity value="0"/>
                </queryAck>
                <queryByParameter>
                    <queryId root="BB7321A1-3365-44BA-8F7C-AF54EF0F0146"/>
                    <parameterList>
                        <administrativeGender>
                            <value code="F"/>
                        </administrativeGender>
                        <clientId>
                            <value root="2.16.124.10.101.1.60.100" extension="MICF93560415"/>
                        </clientId>
                        <deceasedIndicator xsi:nil="true"/>
                        <deceasedTime xsi:nil="true"/>
                        <languageCode xsi:nil="true"/>
                        <multipleBirthIndicator xsi:nil="true"/>
                        <multipleBirthOrderNumber xsi:nil="true"/>
                        <personBirthtime>
                            <value value="20330604"/>
                        </personBirthtime>
                        <personName>
                            <value>
                                <given partType="GIV">Michel</given>
                                <family partType="FAM">Flore</family>
                            </value>
                        </personName>
                        <personalRelationshipCode xsi:nil="true"/>
                    </parameterList>
                </queryByParameter>
            </controlActEvent>
        </PRPA_IN101104CA>
    </s:Body>
</s:Envelope>